In [63]:
# to use sql and pandas libraries

import sqlite3
import pandas as pd

In [119]:
# to read the excel file for analysing the data

df = pd.read_excel('OptiConnect_Solutions.xlsx')

In [115]:
# to display the contents in the excel file uploaded

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1772 entries, 0 to 1771
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Call_Id              1772 non-null   object
 1   Date                 1772 non-null   datetime64[ns]
 2   Agent                1772 non-null   object
 3   Department           1772 non-null   object
 4   answered             1772 non-null   object
 5   Resolved             1772 non-null   object
 6   Speed_of_Answer      1455 non-null   float64
 7   AvgTalkDuration      1455 non-null   object
 8   Satisfaction_rating  1455 non-null   float64
 9   Column1              0 non-null      float64
dtypes: datetime64[ns](1), float64(3), object(6)
memory usage: 138.6+ KB

In [120]:
# to establish the sql server and creating a memory

conn = sqlite3.connect(':memory:')

In [121]:
# to load data frames into sql database

df.to_sql("opticonnect",conn, index=False, if_exists='replace')

1772

In [122]:
# creating a function to read the data frame with sql query


def execute_query(query):
  return pd.read_sql_query(query, conn)

In [123]:
# understand the data

execute_query("select * from opticonnect limit 10;")

,Call_Id,Date,Agent,Department,answered,Resolved,Speed_of_Answer,AvgTalkDuration,Satisfaction_rating,Column1
0,ID1771,2016-01-31 17:34:04.800000,Jim,Fridge,Y,Y,91.0,00:02:58.667000,3.0,None
1,ID1772,2016-01-31 17:34:04.800000,Greg,Air Conditioner,Y,Y,121.0,00:06:01.008000,2.0,None
2,ID1769,2016-01-31 17:08:09.600000,Dan,Fridge,N,N,NaN,None,NaN,None
3,ID1770,2016-01-31 17:08:09.600000,Diane,Toaster,Y,Y,78.0,00:01:02.568000,4.0,None
4,ID1767,2016-01-31 16:56:38.400000,Becky,Washing Machine,Y,Y,58.0,00:04:41.917000,5.0,None
5,ID1768,2016-01-31 16:56:38.400000,Dan,Television,N,N,NaN,None,NaN,None
6,ID1765,2016-01-31 16:20:38.400000,Greg,Television,Y,Y,95.0,00:05:00.554000,3.0,None
7,ID1766,2016-01-31 16:20:38.400000,Becky,Washing Machine,Y,Y,49.0,00:01:58.011000,3.0,None
8,ID1761,2016-01-31 16:09:07.200000,Stewart,Washing Machine,Y,Y,103.0,00:06:13.686000,4.0,None
9,ID1762,2016-01-31 16:09:07.200000,Becky,Washing Machine,Y,Y,81.0,00:03:25.626000,2.0,None

In [125]:
conn.execute("""update opticonnect
SET AvgTalkDuration = substr(AvgTalkDuration, 1, 8);""")

In [126]:
conn.commit()

In [127]:
execute_query("select * from opticonnect")

,Call_Id,Date,Agent,Department,answered,Resolved,Speed_of_Answer,AvgTalkDuration,Satisfaction_rating,Column1
0,ID1771,2016-01-31 17:34:04.800000,Jim,Fridge,Y,Y,91.0,00:02:58,3.0,None
1,ID1772,2016-01-31 17:34:04.800000,Greg,Air Conditioner,Y,Y,121.0,00:06:01,2.0,None
2,ID1769,2016-01-31 17:08:09.600000,Dan,Fridge,N,N,NaN,None,NaN,None
3,ID1770,2016-01-31 17:08:09.600000,Diane,Toaster,Y,Y,78.0,00:01:02,4.0,None
4,ID1767,2016-01-31 16:56:38.400000,Becky,Washing Machine,Y,Y,58.0,00:04:41,5.0,None
...,...,...,...,...,...,...,...,...,...,...
1767,ID0006,2016-01-01 10:00:28.800000,Stewart,Air Conditioner,N,N,NaN,None,NaN,None
1768,ID0003,2016-01-01 09:47:31.200000,Stewart,Washing Machine,Y,Y,10.0,00:02:11,3.0,None
1769,ID0004,2016-01-01 09:47:31.200000,Greg,Washing Machine,Y,Y,53.0,00:00:37,2.0,None
1770,ID0001,2016-01-01 09:12:58,Diane,Washing Machine,Y,Y,109.0,00:02:23,3.0,None
1771,ID0002,2016-01-01 09:12:57.600000,Becky,Air Conditioner,Y,N,70.0,00:04:02,3.0,None

# To find the total number of calls
1. using count(call id)

In [55]:
execute_query("select count(Call_Id) as total_calls from opticonnect;")

   total_calls
0         1772

To find total number of calls answered:
1. We can calculate by using count function in answered column and applying a condition that answered = Y

In [48]:
execute_query("select count(answered) as answered_calls from opticonnect where answered = 'Y';")

   answered_calls
0            1455

In [49]:
#  calls answered = answered calls / total calls

1455 / 1772 * 100

82.11060948081264

To find total number of calls resolved :
1. we can calculate by using count of resolved columns with a condition of resolved = Y

In [50]:
execute_query("select count(Resolved) as resolved_calls from opticonnect where Resolved = 'Y';")

   resolved_calls
0            1311

In [52]:
#  calls resolved = resolved_calls / answered calls

1311 / 1455 * 100

90.10309278350516

To find abanden calls:
1. we can find the abanden calls by using count of answered = N

In [46]:
execute_query("select count(answered) as abanden_calls from opticonnect where answered = 'N';")

   abanden_calls
0            317

In [53]:
# to find abanden rate =  abanden_calls / total calls

317 / 1772  * 100

17.88939051918736

To find calls less than 180 sec :
1. we can find by using count of avg talk duration with a condition between 0 to 3 min

In [103]:
execute_query("select count(AvgTalkDuration) as calls_less from opticonnect where AvgTalkDuration between '00:00:00' and '00:03:00'; ")

   calls_less
0         569

In [104]:
# calls < 3 min = calls less / calls answered

569 / 1455  * 100

39.106529209621996

To find satisfaction count and count of less satisfaction rate
1. count of satisfaction rating can be calculated
2. count of less satisfaction can be calculated

In [128]:
execute_query("select count(Satisfaction_rating) as satisfaction_count  from opticonnect where Satisfaction_rating >= '1';")

   count(Satisfaction_rating)
0                        1455

In [130]:
execute_query("select count(Satisfaction_rating) as less_satisfaction from opticonnect where Satisfaction_rating between '1' and '3';")

   less_satisfaction
0                724

In [131]:
# to find satisfaction less than 4 = less satisfaction / satisfaction count

724 / 1455 * 100

49.75945017182131

To find average speed of answer of total calls

In [133]:
execute_query("select avg(Speed_of_Answer) as avg_speed from opticonnect;")

   avg_speed
0  67.219931

To find total calls answered with satisfaction rating

In [138]:
execute_query("select Satisfaction_rating,count(Satisfaction_rating) from opticonnect group by Satisfaction_rating;")

   Satisfaction_rating  count(Satisfaction_rating)
0                  NaN                           0
1                  1.0                         121
2                  2.0                         146
3                  3.0                         457
4                  4.0                         413
5                  5.0                         318

To find Agent's Resolved calls

In [151]:
execute_query("select Agent,count(Resolved) as Resolved_calls from opticonnect where Resolved = 'Y' group by Agent;")

     Agent  Resolved_calls
0    Becky             154
1      Dan             177
2    Diane             168
3     Greg             155
4      Jim             173
5      Joe             169
6   Martha             152
7  Stewart             163

To find total calls , answered calls, resolved calls ,average speed of answer with respective to agents

In [150]:
execute_query("""select Agent,count(Call_Id) as total_calls,
sum(case when answered = 'Y' then 1 else 0 end)as answered_call,
sum(case when Resolved = 'Y' then 1 else 0 end)as resolved_call,
avg(Speed_of_Answer)
from opticonnect group by Agent;""")

     Agent  total_calls  answered_call  resolved_call  avg(Speed_of_Answer)
0    Becky          216            177            154             64.350282
1      Dan          227            190            177             66.952632
2    Diane          222            185            168             63.935135
3     Greg          208            173            155             67.196532
4      Jim          228            187            173             66.663102
5      Joe          221            186            169             71.155914
6   Martha          220            171            152             71.456140
7  Stewart          230            186            163             66.241935